Microchip-MPLAB-Harmony/reference_apps_pic32cm/apps/pic32cm_gv_vl_cnano/pic32cm_gv_vl_cnano_mikroe_click/pic32cm_gv_mcp25625/firmware/src/packs/PIC32CM3204GV00064_DFP/component/sercom.h
/* SERCOM register API structure */
typedef struct
{  /* Serial Communication Interface */
  __IO  uint32_t                       SERCOM_CTRLA;       /* Offset: 0x00 (R/W  32) USART_INT Control A */
  __IO  uint32_t                       SERCOM_CTRLB;       /* Offset: 0x04 (R/W  32) USART_INT Control B */
  __IO  uint8_t                        SERCOM_DBGCTRL;     /* Offset: 0x08 (R/W  8) USART_INT Debug Control */
  __I   uint8_t                        Reserved1[0x01];
  __IO  uint16_t                       SERCOM_BAUD;        /* Offset: 0x0A (R/W  16) USART_INT Baud */
  __IO  uint8_t                        SERCOM_INTENCLR;    /* Offset: 0x0C (R/W  8) USART_INT Interrupt Enable Clear */
  __IO  uint8_t                        SERCOM_INTENSET;    /* Offset: 0x0D (R/W  8) USART_INT Interrupt Enable Set */
  __IO  uint8_t                        SERCOM_INTFLAG;     /* Offset: 0x0E (R/W  8) USART_INT Interrupt Flag Status and Clear */
  __I   uint8_t                        Reserved2[0x01];
  __IO  uint16_t                       SERCOM_STATUS;      /* Offset: 0x10 (R/W  16) USART_INT Status */
  __I   uint8_t                        Reserved3[0x06];
  __IO  uint16_t                       SERCOM_DATA;        /* Offset: 0x18 (R/W  16) USART_INT Data */
} sercom_usart_int_registers_t;

/* SERCOM hardware registers */
typedef union
{  /* Serial Communication Interface */
       sercom_i2cm_registers_t        I2CM;           /* I2C Master Mode */
       sercom_i2cs_registers_t        I2CS;           /* I2C Slave Mode */
       sercom_spis_registers_t        SPIS;           /* SPI Slave Mode */
       sercom_spim_registers_t        SPIM;           /* SPI Master Mode */
       sercom_usart_ext_registers_t   USART_EXT;      /* USART EXTERNAL CLOCK Mode */
       sercom_usart_int_registers_t   USART_INT;      /* USART INTERNAL CLOCK Mode */
} sercom_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMGV00_SERCOM_COMPONENT_H_ */
